In [ ]:
#My First Thought to the Answer for this Assignment. Feels a Little Basic
a = []
b = []
c = []
data = [10,  20, 30, 40, 50, 60, 70, 80, 90]
for i in data:
    if i >= 10 and i <= 30:
        a.append(i)
    if i >= 20 and i <= 40:
        b.append(i)
    if i >= 30 and i <= 50:
            c.append(i)
output = [a,b,c]
print (a)
print (b)
print (c)
print(output)

lis1 = [data[0:2]]
lis2 = [data[1:3]]
lis3 = [data[2:4]]
output_alt = [lis1 +lis2 +lis3]
print(output_alt)

data = [10,  20, 30, 40, 50, 60, 70, 80, 90]


[[10, 20, 30], [20, 30, 40], [30, 40, 50].....]

In [ ]:
0, 1, 2: 
1, 2, 3: 
2, 3, 4:
3, 4, 5:

In [18]:
data = [2, 34, 1, 20, 7]

In [ ]:
data[start:stop:step]

In [24]:
data[:4:]

[2, 34, 1, 20]

In [25]:
output = list()
for idx in range(len(data)):
    if idx < len(data) - 2:
        output.append(data[idx: idx + 3])

In [26]:
output

[[2, 34, 1], [34, 1, 20], [1, 20, 7]]

In [34]:
def man(lis, n):
    output = list()
    for idx in range(len(data)):
        #if idx < len(data) - (n - 1):
        if idx < len(data) + 1 - n:
            output.append(data[idx: idx + n]) 
    return output

In [37]:
data = [2, 34, 1, 20, 7, 100, 20, 1111, 234, 1990]

In [38]:
man(data, 4)

[[2, 34, 1, 20],
 [34, 1, 20, 7],
 [1, 20, 7, 100],
 [20, 7, 100, 20],
 [7, 100, 20, 1111],
 [100, 20, 1111, 234],
 [20, 1111, 234, 1990]]

In [192]:
# Bolu, Abraham, Debola, Ige, Brown, Godswill: Update the ReadMe file
# Tayo, Leke, Asido, Yinka, Kola: Write questions that we can answer using the data
# Lekan, Loko, Dele, Charles: Answer those questions

In [40]:
# Decorator

In [41]:
# Method Overloading

In [42]:
lis = [1, 2, 3, 4]

In [43]:
name = 'Omolewa'

In [45]:
(2).__add__(3)

5

In [46]:
2 + 3

5

In [60]:
class Mathematics:
    
    def __init__(self, x, y):
        self.x = x
        self.y = y
    
    def __add__(self, other):
        return self.x ** self.y

In [61]:
maths1 = Mathematics(10, 5)
maths2 = Mathematics(11, 12)

In [62]:
maths1.y

5

In [63]:
#maths1.__add__(maths1.x + maths1.y)

100000

In [64]:
maths1 + maths

100000

In [69]:
class Mathematics:
    
    def __init__(self, x):
        self.x = x
    
    def __add__(self, other):
        return 5 * (self.x + other.x)

In [70]:
maths1 = Mathematics(10)
maths2 = Mathematics(200)

In [71]:
maths1 + maths2

1050

In [72]:
2 + 5

7

In [75]:
(2).__add__(5)

7

In [76]:
## Pandas

In [105]:
import pandas as pd

In [106]:
dic = {
    'Names': ['Omolewa', 'Bukola', 'Kola', 'Lekan', 'Charles', 'Debola']
}
dic['Country'] = ['usa', 'uk', 'uk', 'nigeria', 'cameroun', 'georgia']

In [107]:
df = pd.DataFrame(dic)

In [108]:
df

     Names
0  Omolewa
1   Bukola
2     Kola
3    Lekan
4  Charles
5   Debola

In [109]:
dic['Country'] = ['usa', 'uk', 'uk', 'nigeria', 'cameroun', 'georgia']

In [110]:
dic

{'Names': ['Omolewa', 'Bukola', 'Kola', 'Lekan', 'Charles', 'Debola'],
 'Country': ['usa', 'uk', 'uk', 'nigeria', 'cameroun', 'georgia']}

In [111]:
df = pd.DataFrame(dic)
df

     Names   Country
0  Omolewa       usa
1   Bukola        uk
2     Kola        uk
3    Lekan   nigeria
4  Charles  cameroun
5   Debola   georgia

In [113]:
df['Age'] = [20, 12, 17, 10, 30, 35]

In [94]:
df

     Names   Country  Age
0  Omolewa       usa   20
1   Bukola        uk   12
2     Kola        uk   17
3    Lekan   nigeria   10
4  Charles  cameroun   30
5   Debola   georgia   35

In [97]:
df.head(3)

     Names Country  Age
0  Omolewa     usa   20
1   Bukola      uk   12
2     Kola      uk   17

In [99]:
df.tail(3)

     Names   Country  Age
3    Lekan   nigeria   10
4  Charles  cameroun   30
5   Debola   georgia   35

In [103]:
df.drop('Country', axis = 1, inplace=True)

In [104]:
df

     Names  Age
0  Omolewa   20
1   Bukola   12
2     Kola   17
3    Lekan   10
4  Charles   30
5   Debola   35

In [114]:
df

     Names   Country  Age
0  Omolewa       usa   20
1   Bukola        uk   12
2     Kola        uk   17
3    Lekan   nigeria   10
4  Charles  cameroun   30
5   Debola   georgia   35

In [115]:
df.drop(['Names', 'Age'], axis = 1)

    Country
0       usa
1        uk
2        uk
3   nigeria
4  cameroun
5   georgia

In [116]:
df

     Names   Country  Age
0  Omolewa       usa   20
1   Bukola        uk   12
2     Kola        uk   17
3    Lekan   nigeria   10
4  Charles  cameroun   30
5   Debola   georgia   35

In [117]:
df[: 3]

     Names Country  Age
0  Omolewa     usa   20
1   Bukola      uk   12
2     Kola      uk   17

In [120]:
df

     Names   Country  Age
0  Omolewa       usa   20
1   Bukola        uk   12
2     Kola        uk   17
3    Lekan   nigeria   10
4  Charles  cameroun   30
5   Debola   georgia   35

In [121]:
df['Names']

0    Omolewa
1     Bukola
2       Kola
3      Lekan
4    Charles
5     Debola
Name: Names, dtype: object

In [122]:
df.Names

0    Omolewa
1     Bukola
2       Kola
3      Lekan
4    Charles
5     Debola
Name: Names, dtype: object

In [124]:
df.drop(0)

     Names   Country  Age
1   Bukola        uk   12
2     Kola        uk   17
3    Lekan   nigeria   10
4  Charles  cameroun   30
5   Debola   georgia   35

In [125]:
df[['Names', 'Country']]

     Names   Country
0  Omolewa       usa
1   Bukola        uk
2     Kola        uk
3    Lekan   nigeria
4  Charles  cameroun
5   Debola   georgia

In [126]:
df

     Names   Country  Age
0  Omolewa       usa   20
1   Bukola        uk   12
2     Kola        uk   17
3    Lekan   nigeria   10
4  Charles  cameroun   30
5   Debola   georgia   35

In [129]:
df.loc[(df['Country'] == 'uk') & (df['Names'] == 'Kola')]

  Names Country  Age
2  Kola      uk   17

In [130]:
df.loc[0]

Names      Omolewa
Country        usa
Age             20
Name: 0, dtype: object

In [131]:
df.iloc[0]

Names      Omolewa
Country        usa
Age             20
Name: 0, dtype: object

In [133]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [134]:
df.index = df['Names']

In [135]:
df

           Names   Country  Age
Names
Omolewa  Omolewa       usa   20
Bukola    Bukola        uk   12
Kola        Kola        uk   17
Lekan      Lekan   nigeria   10
Charles  Charles  cameroun   30
Debola    Debola   georgia   35

In [137]:
df.iloc['Omolewa']

TypeError: Cannot index by location index with a non-integer key

In [138]:
df

           Names   Country  Age
Names
Omolewa  Omolewa       usa   20
Bukola    Bukola        uk   12
Kola        Kola        uk   17
Lekan      Lekan   nigeria   10
Charles  Charles  cameroun   30
Debola    Debola   georgia   35

In [139]:
def capitalize(country):
    return country.upper()

In [140]:
capitalize('nigeria')

'NIGERIA'

In [141]:
df['Country'].apply(capitalize)

Names
Omolewa         USA
Bukola           UK
Kola             UK
Lekan       NIGERIA
Charles    CAMEROUN
Debola      GEORGIA
Name: Country, dtype: object

In [144]:
df['Country'] = df['Country'].apply(capitalize)

In [145]:
df

           Names   Country  Age   ContCap
Names
Omolewa  Omolewa       USA   20       USA
Bukola    Bukola        UK   12        UK
Kola        Kola        UK   17        UK
Lekan      Lekan   NIGERIA   10   NIGERIA
Charles  Charles  CAMEROUN   30  CAMEROUN
Debola    Debola   GEORGIA   35   GEORGIA

In [146]:
df['Initials'] = df['Names'].apply(lambda name: name[0].upper())

In [147]:
df

           Names   Country  Age   ContCap Initials
Names
Omolewa  Omolewa       USA   20       USA        O
Bukola    Bukola        UK   12        UK        B
Kola        Kola        UK   17        UK        K
Lekan      Lekan   NIGERIA   10   NIGERIA        L
Charles  Charles  CAMEROUN   30  CAMEROUN        C
Debola    Debola   GEORGIA   35   GEORGIA        D

In [148]:
df.columns

Index(['Names', 'Country', 'Age', 'ContCap', 'Initials'], dtype='object')

In [149]:
df.at['Charles', 'Country']

'CAMEROUN'

In [150]:
df['Age'] + 10

Names
Omolewa    30
Bukola     22
Kola       27
Lekan      20
Charles    40
Debola     45
Name: Age, dtype: int64

In [151]:
df

           Names   Country  Age   ContCap Initials
Names
Omolewa  Omolewa       USA   20       USA        O
Bukola    Bukola        UK   12        UK        B
Kola        Kola        UK   17        UK        K
Lekan      Lekan   NIGERIA   10   NIGERIA        L
Charles  Charles  CAMEROUN   30  CAMEROUN        C
Debola    Debola   GEORGIA   35   GEORGIA        D

In [153]:
grp = df.groupby('Country')

In [155]:
grp.groups

{'CAMEROUN': ['Charles'], 'GEORGIA': ['Debola'], 'NIGERIA': ['Lekan'], 'UK': ['Bukola', 'Kola'], 'USA': ['Omolewa']}

In [157]:
grp.get_group('UK')

         Names Country  Age ContCap Initials
Names
Bukola  Bukola      UK   12      UK        B
Kola      Kola      UK   17      UK        K

In [159]:
df

           Names   Country  Age   ContCap Initials
Names
Omolewa  Omolewa       USA   20       USA        O
Bukola    Bukola        UK   12        UK        B
Kola        Kola        UK   17        UK        K
Lekan      Lekan   NIGERIA   10   NIGERIA        L
Charles  Charles  CAMEROUN   30  CAMEROUN        C
Debola    Debola   GEORGIA   35   GEORGIA        D

In [160]:
df.dtypes

Names       object
Country     object
Age          int64
ContCap     object
Initials    object
dtype: object

In [168]:
df.describe().loc['count']

Age    6.0
Name: count, dtype: float64

In [170]:
type(df.describe())

pandas.core.frame.DataFrame

In [171]:
import numpy as np

In [172]:
dic = {
    'Names': ['Omolewa', np.nan, 'Kola', 'Lekan', 'Charles', 'Debola']
}
dic['Country'] = ['usa', 'uk', 'uk', 'nigeria', np.nan, 'georgia']

In [173]:
df = pd.DataFrame(dic)

In [174]:
df

     Names  Country
0  Omolewa      usa
1      NaN       uk
2     Kola       uk
3    Lekan  nigeria
4  Charles      NaN
5   Debola  georgia

In [175]:
df.isna()

   Names  Country
0  False    False
1   True    False
2  False    False
3  False    False
4  False     True
5  False    False

In [177]:
df.isna().sum()

Names      1
Country    1
dtype: int64

In [178]:
df.dropna()

     Names  Country
0  Omolewa      usa
2     Kola       uk
3    Lekan  nigeria
5   Debola  georgia

In [179]:
df.fillna(0)

     Names  Country
0  Omolewa      usa
1        0       uk
2     Kola       uk
3    Lekan  nigeria
4  Charles        0
5   Debola  georgia

In [181]:
df

     Names  Country
0  Omolewa      usa
1      NaN       uk
2     Kola       uk
3    Lekan  nigeria
4  Charles      NaN
5   Debola  georgia

In [180]:
df.fillna(method='ffill')

     Names  Country
0  Omolewa      usa
1  Omolewa       uk
2     Kola       uk
3    Lekan  nigeria
4  Charles  nigeria
5   Debola  georgia

In [182]:
df.fillna(method='bfill')

     Names  Country
0  Omolewa      usa
1     Kola       uk
2     Kola       uk
3    Lekan  nigeria
4  Charles  georgia
5   Debola  georgia

In [183]:
df

     Names  Country
0  Omolewa      usa
1      NaN       uk
2     Kola       uk
3    Lekan  nigeria
4  Charles      NaN
5   Debola  georgia

In [184]:
df.to_csv('cleaned.csv')

In [186]:
df.values[0]

array(['Omolewa', 'usa'], dtype=object)

In [187]:
df

     Names  Country
0  Omolewa      usa
1      NaN       uk
2     Kola       uk
3    Lekan  nigeria
4  Charles      NaN
5   Debola  georgia

In [188]:
df['Country'].unique()

array(['usa', 'uk', 'nigeria', nan, 'georgia'], dtype=object)

In [189]:
df['Country'].nunique()

4

In [190]:
df['Country'].value_counts()

uk         2
usa        1
nigeria    1
georgia    1
Name: Country, dtype: int64